Revit 2027 API
ACADExportOptions.TextTreatment Property
 The text treatment. Deault value is TextTreatment.Exact.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TextTreatment TextTreatment { get; set; }
Public Property TextTreatment As TextTreatment
	Get
	Set
public:
property TextTreatment TextTreatment {
	TextTreatment get ();
	void set (TextTreatment value);
}
member TextTreatment : TextTreatment with get, set
Property Value
TextTreatment
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ACADExportOptions Class
Autodesk.Revit.DB Namespace